
// 职位的信息
// id       
// name
// level    级别
// series  序列 

// 职位序列
const series = {
    p: "技术序列",
    m: "管理序列"
}

// 技术序列中的分级
const pLevel = {
    4: "初级工程师",
    5: '中级工程师',
    6: '高级工程师',
    7: '专家',
    8: '高级专家',
    9: '资深专家',
    10: '研究员',
    11: '高级研究员',
    12: '资深研究员',
    13: '科学家',
    14: '资深科学家'
}

// 管理序列中的分级
const mLevel= {
    1: "主管",
    2: '经理',
    3: '资深经理',
    4: '总监',
    5: '资深总监',
    6: '副总裁',
    7: '资深副总裁',
    8: '执行副总裁',
    9: '副董事长',
    10: '董事长',
}


// 技术序列中的职位权重
const pWeight ={
    4: 40,
    5: 50,
    6: 60,
    7: 70,
    8: 80,
    9: 90,
    10: 100,
    11: 110,
    12: 120,
    13: 130,
    14: 140
}

// 管理序列中的职位权重
const mWeight = {
    1: 60,
    2: 70,
    3: 80,
    4: 90,
    5: 100,
    6: 110,
    7: 120,
    8: 130,
    9: 140,
    10: 150,
}

// 项目
const project = {
    1: "BFT",
    2: "FinChainIM",
    2: "AutoPilot",
    4: "IOT", // internet of things 物联网
}

// 全部的项目小组
const group = {
    1: "前端",
    2: "后台",
    3: 'UI',
    4: "UE",
    5: "产品",
    6: "算法",
}


export {
    series,
    pLevel,
    mLevel,
    pWeight,
    mWeight,
    project,
    group,
}

 